app/controllers/appapi/v1/event_controller.rb

SELECT "places".* FROM "places" ORDER BY created_at DESC
SELECT COUNT(*) FROM "places"
---
	def index
		# Paginated the pages so a limit amount of data is always sent to user
		@events = Place.order('created_at DESC').page(params[:page]).per_page(10)

INSERT INTO "places" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 24 Apr 2014 07:26:38 UTC +00:00], ["updated_at", Thu, 24 Apr 2014 07:26:38 UTC +00:00]]
---
	def create
		@place = Place.new
		@place.location = params[:location]
		@place.description = params[:description]
		@place.place = params[:place]
		@place.date = params[:date]
		@place.time = params[:time]

	 	puts @place

		respond_to do |format|
	      if @place.save